IdeaRS.OpenModel.Detail.OpeningRectOffsets
Representation of rectangular opening in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.OpeningRectOffsets.#ctor
Constructor

IdeaRS.OpenModel.Detail.OpeningRectOffsets.X1
Left

IdeaRS.OpenModel.Detail.OpeningRectOffsets.X2
Right

IdeaRS.OpenModel.Detail.OpeningRectOffsets.Y1
Bottom

IdeaRS.OpenModel.Detail.OpeningRectOffsets.Y2
Top

IdeaRS.OpenModel.Detail.OpeningRectOffsets.OffsetX1
top left X offset

IdeaRS.OpenModel.Detail.OpeningRectOffsets.OffsetX2
top right x offset

IdeaRS.OpenModel.Detail.OpeningRectOffsets.OffsetY1
right bottom y offset

IdeaRS.OpenModel.Detail.OpeningRectOffsets.OffsetY2
right top y offset